# Books Core Assignment

**Student:** Matthew Malueg

**Books Database ERD**

 ![Books](Data/books_erd.png)

# Imports and Loading

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd
from sqlalchemy.types import INT, VARCHAR

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
connection = f"mysql+pymysql://{username}:{password}@localhost/books"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

# Examine and Preprocess Data

- Examine each of the four files dtypes for compatibility with generated database

In [4]:
# Read in the given files for comparison
users = pd.read_csv('Data/users.csv')
books = pd.read_csv('Data/books.csv')
authors = pd.read_csv('Data/authors.csv')
favorites = pd.read_csv('Data/favorites.csv')

## Compare generated tables with given files

**Users**

In [5]:
# Examine our 'users' table
q = """DESCRIBE users;"""
pd.read_sql(q, conn)

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [6]:
# Compare to given file
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

- Column names, formatting, and dtypes match.

**Books**

In [7]:
# Examine our 'books' table
q = """DESCRIBE books;"""
pd.read_sql(q, conn)

       Field         Type Null  Key Default           Extra
0         id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

In [8]:
# Compare to given file
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

- Column names, formatting, and dtypes match.

**Authors**

In [9]:
# Examine our 'authors' table
q = """DESCRIBE authors;"""
pd.read_sql(q, conn)

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [10]:
# Compare to given file
authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

- Column names, formatting, and dtypes match.

**Favorites**

In [11]:
# Examine our 'favorites' table
q = """DESCRIBE favorites;"""
pd.read_sql(q, conn)

     Field Type Null  Key Default Extra
0  user_id  int   NO  MUL    None
1  book_id  int   NO  MUL    None

In [12]:
# Compare to given file
favorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

- Column names, formatting, and dtypes match.
- (Initially forgot to change 'users_id' and 'books_id' to singular 'user_id' and 'book_id'; corrected)

# Insert values into tables

## FOREIGN_KEY_CHECKS

**Set FOREIGN_KEY_CHECKS = 0**

In [13]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

**Check status of FOREIGN_KEY_CHECKS**

In [14]:
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     0

## Inserting values

**Users table**

In [18]:
users.to_sql('users', conn, index=False, if_exists='append')

3

**Books table**

In [19]:
books.to_sql('books', conn, index=False, if_exists='append')

6

**Authors table**

In [20]:
authors.to_sql('authors', conn, index=False, if_exists='append')

5

**Favorites**

In [21]:
favorites.to_sql('favorites', conn, index=False, if_exists='append')

7

# Testing the DataBase

In [25]:
# Confirm all tables still present
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [46]:
# Test database functionality by querying favorite books of John Doe
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.first_name = 'John' AND users.last_name = 'Doe'));
"""
pd.read_sql(q, conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1